{
    "vocab_size": 250112,
    "d_model": 768,
    "d_kv": 64,
    "d_ff": 2048,
    "num_layers": 12,
    "num_decoder_layers": 12,
    "num_heads": 12,
    "relative_attention_num_buckets": 32,
    "relative_attention_max_distance": 128,
    "dropout_rate": 0.1,
    "classifier_dropout": 0.0,
    "layer_norm_epsilon": 1e-06,
    "initializer_factor": 1.0,
    "feed_forward_proj": "gated-gelu",
    "use_cache": true,
    "dense_act_fn": "gelu_new",
    "is_gated_act": true,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": null,
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": false,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": true,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
        "T5ForConditionalGeneration"
    ],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "tokenizer_class": "T5Tokenizer",
    "prefix": null,
    "bos_token_id": null,
    "pad_token_id": 0,
    "eos_token_id": 1,
    "sep_token_id": null,
    "decoder_start_token_id": 0,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "NlpHUST/t5-en-vi-base",
    "transformers_version": "4.37.2",
    "model_type": "t5",
    "output_past": true
}